In [1]:
import pandas as pd

In [5]:
s1 = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
s2=pd.Series({'a':10,'b':15,'c':20},dtype='int32')
s2

a    10
b    15
c    20
dtype: int32

In [11]:
s1[:3:2]

a    1
c    3
dtype: int64

In [19]:
s1[-5::2]

a    1
c    3
e    5
dtype: int64

In [22]:
s1+s2

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
a   NaN
b   NaN
c   NaN
dtype: float64

In [21]:
s1 = pd.Series([1,2,3,4,5])

In [33]:
d = pd.Series({'Ketul':50,"Shivanu":50})
d = pd.DataFrame({'Name':['Ketul',"Shivani",'Chandani'],'Age':[28,27,28],'status':['s','d','s']})
d

       Name  Age status
0     Ketul   28      s
1   Shivani   27      d
2  Chandani   28      s

In [34]:
d.iloc[0:2,[1,2]]

   Age status
0   28      s
1   27      d

In [39]:
d.loc[1:1,['Age','status']]

   Age status
1   27      d

In [41]:
d.drop('status',axis=1)

       Name  Age
0     Ketul   28
1   Shivani   27
2  Chandani   28

In [48]:
d.drop(d.iloc[1:3].index,axis=0)

    Name  Age status
0  Ketul   28      s

In [49]:
d.head()

       Name  Age status
0     Ketul   28      s
1   Shivani   27      d
2  Chandani   28      s

In [52]:
d.Age.mean()

27.666666666666668

In [53]:
d.Age.median()

28.0

In [55]:
def increase(s):
    return s*2

d['new']=d['Age'].apply(increase)

In [57]:
d.Name.value_counts()

Ketul       1
Shivani     1
Chandani    1
Name: Name, dtype: int64

In [59]:
d.sort_values(by='Age')

       Name  Age status  new
1   Shivani   27      d   54
0     Ketul   28      s   56
2  Chandani   28      s   56